Public Attributes | List of all members
API_StairModelViewOptions Struct Reference
Project Navigator
Represents the model view options of Stairs made with Stair Tool. The entire structure is Archicad only. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
char  | stair3DDetailLevel
Detail level of Stairs in 3D display. (API_Stair3DDetail... etc.)
char  | stairFloorPlanVisualization
Visualization mode for Stairs in Floor Plan view (API_StairFloorPlanVisual... etc.)
bool  | showStairHeadroom
Show the headroom above the stair.
bool  | stairFloorPlanCompWalkingLine
Walking Line is visible in Floor Plan Visualization.
bool  | stairFloorPlanCompNumbering
Numbering is visible in Floor Plan Visualization.
bool  | stairFloorPlanCompUPDOWNText
UP-DOWN Text is visible in Floor Plan Visualization.
bool  | stairFloorPlanCompDescription
Description is visible in Floor Plan Visualization.
bool  | stairFloorPlanCompTreadAccessories
Accessories of Treads are visible in Floor Plan Visualization.
bool  | stairFloorPlanCompStructureBeamSupport
Structure beams of Stairs are visible in Floor Plan Visualization.
bool  | stairFloorPlanCompStructureStringers
Stringers are visible in Floor Plan Visualization.
bool  | stairFloorPlanCompStructureCantilevered
Cantilevered structure is visible in Floor Plan Visualization.
bool  | stairReflectedCompWalkingLine
Walking Line is visible in Reflected Ceiling Plan Display.
bool  | stairReflectedCompDescription
Description is visible in Reflected Ceiling Plan Display.
bool  | stairReflectedCompStructureBeamSupport
Structural beams of Stairs are visible in Reflected Ceiling Plan Display.
bool  | stairReflectedCompStructureStringers
Stringers of Stairs are visible in Reflected Ceiling Plan Display.
bool  | stairReflectedCompStructureCantilevered
Cantilevered structure is visible in Reflected Ceiling Plan Display.
API_AttributeIndex  | stairSchemeSurfaceIndex
Index of the Surface attribute to use in Schematic 3D Display Detail.
API_AttributeIndex  | stairSchemeCutLineIndex
Index of the Line attribute to use in Schematic 3D Display Detail as Cut Line.
short  | stairSchemeCutLinePenIndex
Index of the Pen in the current Pen Table to use in Schematic 3D Display Detail as the Cut Line Pen.
API_AttributeIndex  | stairSchemeUncutLineIndex
Index of the Line attribute to use in Schematic 3D Display Detail as Uncut Line.
short  | stairSchemeUncutLinePenIndex
Index of the Pen in the current Pen Table to use in Schematic 3D Display Detail as the Uncut Line Pen.
Detailed Description
Represents the model view options of Stairs made with Stair Tool. The entire structure is Archicad only.
Remarks
These settings correspond to the relevant items in the Document/Set Model View/Model View Options dialog/Stair Options page.
 Stair MVO
Member Data Documentation
◆ showStairHeadroom
 API_StairModelViewOptions::showStairHeadroom
Show the headroom above the stair.
◆ stair3DDetailLevel
 API_StairModelViewOptions::stair3DDetailLevel
Detail level of Stairs in 3D display. (API_Stair3DDetail... etc.)
◆ stairFloorPlanCompDescription
 API_StairModelViewOptions::stairFloorPlanCompDescription
Description is visible in Floor Plan Visualization.
◆ stairFloorPlanCompNumbering
 API_StairModelViewOptions::stairFloorPlanCompNumbering
Numbering is visible in Floor Plan Visualization.
◆ stairFloorPlanCompStructureBeamSupport
 API_StairModelViewOptions::stairFloorPlanCompStructureBeamSupport
Structure beams of Stairs are visible in Floor Plan Visualization.
◆ stairFloorPlanCompStructureCantilevered
 API_StairModelViewOptions::stairFloorPlanCompStructureCantilevered
Cantilevered structure is visible in Floor Plan Visualization.
◆ stairFloorPlanCompStructureStringers
 API_StairModelViewOptions::stairFloorPlanCompStructureStringers
Stringers are visible in Floor Plan Visualization.
◆ stairFloorPlanCompTreadAccessories
 API_StairModelViewOptions::stairFloorPlanCompTreadAccessories
Accessories of Treads are visible in Floor Plan Visualization.
◆ stairFloorPlanCompUPDOWNText
 API_StairModelViewOptions::stairFloorPlanCompUPDOWNText
UP-DOWN Text is visible in Floor Plan Visualization.
◆ stairFloorPlanCompWalkingLine
 API_StairModelViewOptions::stairFloorPlanCompWalkingLine
Walking Line is visible in Floor Plan Visualization.
◆ stairFloorPlanVisualization
 API_StairModelViewOptions::stairFloorPlanVisualization
Visualization mode for Stairs in Floor Plan view (API_StairFloorPlanVisual... etc.)
◆ stairReflectedCompDescription
 API_StairModelViewOptions::stairReflectedCompDescription
Description is visible in Reflected Ceiling Plan Display.
◆ stairReflectedCompStructureBeamSupport
 API_StairModelViewOptions::stairReflectedCompStructureBeamSupport
Structural beams of Stairs are visible in Reflected Ceiling Plan Display.
◆ stairReflectedCompStructureCantilevered
 API_StairModelViewOptions::stairReflectedCompStructureCantilevered
Cantilevered structure is visible in Reflected Ceiling Plan Display.
◆ stairReflectedCompStructureStringers
 API_StairModelViewOptions::stairReflectedCompStructureStringers
Stringers of Stairs are visible in Reflected Ceiling Plan Display.
◆ stairReflectedCompWalkingLine
 API_StairModelViewOptions::stairReflectedCompWalkingLine
Walking Line is visible in Reflected Ceiling Plan Display.
◆ stairSchemeCutLineIndex
 API_StairModelViewOptions::stairSchemeCutLineIndex
Index of the Line attribute to use in Schematic 3D Display Detail as Cut Line.
◆ stairSchemeCutLinePenIndex
 API_StairModelViewOptions::stairSchemeCutLinePenIndex
Index of the Pen in the current Pen Table to use in Schematic 3D Display Detail as the Cut Line Pen.
◆ stairSchemeSurfaceIndex
 API_StairModelViewOptions::stairSchemeSurfaceIndex
Index of the Surface attribute to use in Schematic 3D Display Detail.
◆ stairSchemeUncutLineIndex
 API_StairModelViewOptions::stairSchemeUncutLineIndex
Index of the Line attribute to use in Schematic 3D Display Detail as Uncut Line.
◆ stairSchemeUncutLinePenIndex
 API_StairModelViewOptions::stairSchemeUncutLinePenIndex
Index of the Pen in the current Pen Table to use in Schematic 3D Display Detail as the Uncut Line Pen.